/* Вивести на екран всі числа від 1 до 10 за допомогою циклу while. */
/* let i = 0;
while (i < 10) { 
  alert( i );
  i++;
} */



/* Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. Якщо число не парне, пропустити його за допомогою continue. */
/* 
    for (let i = 0; i < 10; i++) {

       
        if (i % 2 == 0) continue;
      
        alert(i); 
      }

      for (let a = 2; a <= 20; a++) {
        if (a % 2 == 0) {
          alert( a );
        }
      } */

      /* Вивести на екран таблицю множення числа 7 за допомогою циклу for. */


/*       for (var i=7; i<=7; i++) {
        
        var j = 1
      
        while (j<=9) {
          document.write(i + " * " + j + " = " + i*j + "<br>");
          j++;
        }
      } */


     /*  Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while. */
/*      let i = 1;
do {
  alert( i );
  i++;
} while (i < 5); */

/* Створити масив із числами від 1 до 10. За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break. */
